// Получи и выведи в консоль:
// - Заголовок страницы(`document.title`).  
//    - URL текущей страницы(`document.URL`).  
//    - Имя браузера с помощью`navigator`.  

// Перейди на страницу `"https://example.com"` с помощью`location`.  

// Получи доступ к`document.body`, измени его `backgroundColor` на`lightgray`.  

// Выведи в консоль количество узлов(`childNodes.length`) внутри`document.body`.  


// Получение элементов со страницы
// Найди и выведи в консоль:
// - Элемент с`id="main"`.  
//    - Все элементы с классом`"item"`.  
//    - Все`<p>` на странице.  
//    - Первый элемент с классом`"highlight"`.  

// Получи и измени текст первого элемента `<h1>` на`"Новый заголовок"`.  
 


// Создай новый `<p>` с текстом `"Это новый параграф"` и добавь его в конец`document.body`.  

// Создай новый`<div>`, внутри него добавь `<h2>` с текстом`"Привет, мир!"`, вставь в`document.body`.

// Замени первый `<p>` на странице на новый `<p>` с текстом`"Замененный параграф"`.  

// Создай 5 `<div>` с текстом`"Блок X"`, где X — это номер блока(1 - 5).Добавь их в`document.body`.  (использовать цикл)

// Создай новый `<ul>` со списком`["Яблоко", "Груша", "Банан"]`, добавь его в`document.body`.  (использовать цикл)


// Найди элемент с `id="content"` и измени его `color` на`"blue"`.  

// Найди все `<p>` и сделай их `fontSize` равным`"18px"`. (использовать цикл) 

// Создай новый`<div>`, установи ему`width: 200px`, `height: 100px`, `backgroundColor: "red"` и добавь в`document.body`.  
