
// Создай 3 кнопки. При наведении курсора на любую из них должна меняться её надпись на `"Навели!"`, а при уходе мыши — обратно на `"Кнопка N"`.


// Сделай блок `<div>` размером 200x200px. При клике на него цвет должен случайным образом меняться.


// Создай текстовое поле. При вводе текста в нём отображай, какая клавиша была нажата (`event.key`).


// Сделай квадрат, который можно двигать по странице стрелками (вверх/вниз/влево/вправо).


// Реализуй кнопку "Наверх", которая появляется при прокрутке вниз на 300px и по нажатию плавно возвращает наверх страницы.


// Покажи лоадер(анимацию загрузки), который исчезает только после полной загрузки страницы(событие`load`). (лоадер можно взять на этом сайте: https://cssloaders.github.io/)


// После загрузки страницы подсвети все элементы с классом `highlight` жёлтым цветом.


// Есть список `<ul>` с элементами`<li>`.При клике на любой `li` элемент — он выделяется(меняет фон).Реализуй через делегирование на`ul`.


// На основе массива products:
// const products = [
//   { name: 'Ноутбук', price: 1500 },
//   { name: 'Смартфон', price: 800 },
//   { name: 'Наушники', price: 200 }
// ];
// Отобрази элементы в виде маркированного списка
// Добавь кнопку «Показать только дорогие товары(цена > 1000)».
// При нажатии — отобрази только те товары, что стоят больше 1000.


// const products = [
//   { name: 'Кофеварка', price: 4500, image: 'https://img.sila.by/catalog/img7/tovar75820.jpg' },
//   { name: 'Тостер', price: 2300, image: 'https://cdn21vek.by/imgproxy/preview_b/plain/img/galleries/114/951/ctov2103gr_delonghi_5530c53166cf1.jpeg' },
//   { name: 'Миксер', price: 1800, image: 'https://images.deal.by/413620812_mikser-planetarnyj-kitchenaid.jpg' }
// ];
// Отобрази товары в виде карточек:
// — Картинка, название, цена
// — Кнопка «Купить» (пока без функционала)